===============
Описание файлов
===============
1. Список собеседований - список всех собеседований с суммами вилок и офферов
2. Все вопросы - список вопросов отдельно по каждому собеседованию и отдельно по темам
3. Вопросы по Golang - агрегированные и обработанные вопросы по Golang
4. Задачи по Golang - все задачи по Golang на разные темы
5. Папка Задачи - список задач отдельно по каждому собеседованию
6. Вспомогательное/Обработка вопросов - файл, в котором я обрабатываю вопросы


=========================
Подробное описание файлов
=========================

+++++++++++++++++++++++
1. Список собеседований
+++++++++++++++++++++++
Компании могут повторяться. Одинаковые выделены цветом.

Некоторые собесы включали в себя явно выраженные два типа, например Харды + Софты или Финал + Харды

"Моя вилка" - это моя комфортная сумма N (я говорил "рассматриваю от N"). Еще была минимальная сумма, но я ее здесь не указал

"Предложили" - это значит все прошел, обсудили условия, но не смогли договориться и до оффера не дошло


++++++++++++++
2. Все вопросы
++++++++++++++
"ППО" - означает "По предыдущему ответу", то есть я на предыдущий вопрос ответил что-то такое, из-за чего мне задали этот вопрос

Там где указано "Задача N" - нужную задачу искать по номеру собеса в папке Задачи


++++++++++++++++++++
3. Вопросы по Golang 
++++++++++++++++++++
На первой странице частота представлена в виде Часто/Средне/Редко. Распределение такое:
"Часто" - вопрос встретился 5-7 собесах
"Средне" - вопрос встретился в 2-4 собесах
"Редко" - вопрос встретился в 1 собесе

Почему такие числа? 
- Я не придумал ничего лучше

На второй странице представлены числа. 
"Сколько раз встретилась тема" - например у "Мапа" это 13, значит эту тему затронули на 13 собесах
"Частота" - на скольких собесах задали этот вопрос (от всего количества технических). Например 25% это 6 / 24

+++++++++++++++++++++++++++++++++++++
6. Вспомогательное/Обработка вопросов
+++++++++++++++++++++++++++++++++++++
Файл со всеми вопросами по Golang, Тестированию и Базам данных

Сюда я скидываю вопросы по конкретной теме (Исходный вопрос) со всех собесов и далее обрабатываю их. Похожие вопросы в итоге привожу к одному (поле "Вопрос"). Далее считаю статистику и получается файл наподобие "Вопросы по Golang".

Пока что закинул только Golang, Тестирование и Базы данных. Полностью обработал только Golang.
